reports/stage5/wrkLogsPut1.txt
Running 50s test @ http://localhost:8080
  2 threads and 20 connections
  Thread calibration: mean lat.: 2.032ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.035ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.19ms  546.41us  10.06ms   70.24%
    Req/Sec   526.23    107.73     0.89k    63.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.20ms
 75.000%    2.54ms
 90.000%    2.84ms
 99.000%    3.39ms
 99.900%    5.49ms
 99.990%    7.50ms
 99.999%   10.07ms
100.000%   10.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.366     0.000000            1         1.00
       1.488     0.100000         3996         1.11
       1.729     0.200000         7996         1.25
       1.911     0.300000        11985         1.43
       2.063     0.400000        16010         1.67
       2.199     0.500000        20024         2.00
       2.265     0.550000        21978         2.22
       2.333     0.600000        24014         2.50
       2.397     0.650000        25985         2.86
       2.467     0.700000        27991         3.33
       2.539     0.750000        29987         4.00
       2.577     0.775000        30969         4.44
       2.621     0.800000        32000         5.00
       2.665     0.825000        32978         5.71
       2.715     0.850000        33960         6.67
       2.769     0.875000        34966         8.00
       2.801     0.887500        35479         8.89
       2.837     0.900000        35979        10.00
       2.873     0.912500        36468        11.43
       2.913     0.925000        36954        13.33
       2.963     0.937500        37454        16.00
       2.991     0.943750        37711        17.78
       3.021     0.950000        37957        20.00
       3.051     0.956250        38201        22.86
       3.091     0.962500        38459        26.67
       3.127     0.968750        38705        32.00
       3.153     0.971875        38826        35.56
       3.185     0.975000        38955        40.00
       3.213     0.978125        39084        45.71
       3.245     0.981250        39203        53.33
       3.285     0.984375        39324        64.00
       3.309     0.985938        39388        71.11
       3.337     0.987500        39450        80.00
       3.371     0.989062        39516        91.43
       3.411     0.990625        39575       106.67
       3.447     0.992188        39636       128.00
       3.471     0.992969        39668       142.22
       3.511     0.993750        39699       160.00
       3.543     0.994531        39731       182.86
       3.581     0.995313        39762       213.33
       3.655     0.996094        39793       256.00
       3.699     0.996484        39808       284.44
       3.749     0.996875        39824       320.00
       3.869     0.997266        39839       365.71
       4.065     0.997656        39855       426.67
       4.463     0.998047        39870       512.00
       4.687     0.998242        39878       568.89
       4.971     0.998437        39886       640.00
       5.163     0.998633        39894       731.43
       5.363     0.998828        39902       853.33
       5.491     0.999023        39909      1024.00
       5.555     0.999121        39913      1137.78
       5.735     0.999219        39917      1280.00
       6.023     0.999316        39921      1462.86
       6.127     0.999414        39925      1706.67
       6.359     0.999512        39929      2048.00
       6.383     0.999561        39931      2275.56
       6.475     0.999609        39933      2560.00
       6.551     0.999658        39935      2925.71
       6.931     0.999707        39937      3413.33
       7.043     0.999756        39939      4096.00
       7.091     0.999780        39940      4551.11
       7.139     0.999805        39941      5120.00
       7.167     0.999829        39942      5851.43
       7.363     0.999854        39943      6826.67
       7.499     0.999878        39944      8192.00
       7.499     0.999890        39944      9102.22
       7.775     0.999902        39945     10240.00
       7.775     0.999915        39945     11702.86
       7.919     0.999927        39946     13653.33
       7.919     0.999939        39946     16384.00
       7.919     0.999945        39946     18204.44
       8.415     0.999951        39947     20480.00
       8.415     0.999957        39947     23405.71
       8.415     0.999963        39947     27306.67
       8.415     0.999969        39947     32768.00
       8.415     0.999973        39947     36408.89
      10.071     0.999976        39948     40960.00
      10.071     1.000000        39948          inf
#[Mean    =        2.186, StdDeviation   =        0.546]
#[Max     =       10.064, Total count    =        39948]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.41ms
 75.000%    1.60ms
 90.000%    1.78ms
 99.000%    2.23ms
 99.900%    4.41ms
 99.990%    6.55ms
 99.999%    8.93ms
100.000%    8.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.270     0.000000            2         1.00
       1.058     0.100000         4023         1.11
       1.180     0.200000         8037         1.25
       1.264     0.300000        12003         1.43
       1.341     0.400000        15986         1.67
       1.415     0.500000        19998         2.00
       1.449     0.550000        21973         2.22
       1.485     0.600000        23975         2.50
       1.522     0.650000        26004         2.86
       1.559     0.700000        27973         3.33
       1.601     0.750000        29966         4.00
       1.625     0.775000        31006         4.44
       1.648     0.800000        31966         5.00
       1.675     0.825000        32984         5.71
       1.704     0.850000        33981         6.67
       1.737     0.875000        34955         8.00
       1.758     0.887500        35458         8.89
       1.781     0.900000        35968        10.00
       1.807     0.912500        36466        11.43
       1.835     0.925000        36959        13.33
       1.870     0.937500        37458        16.00
       1.888     0.943750        37716        17.78
       1.907     0.950000        37956        20.00
       1.932     0.956250        38208        22.86
       1.959     0.962500        38456        26.67
       1.997     0.968750        38708        32.00
       2.017     0.971875        38826        35.56
       2.039     0.975000        38951        40.00
       2.061     0.978125        39076        45.71
       2.095     0.981250        39209        53.33
       2.127     0.984375        39325        64.00
       2.159     0.985938        39390        71.11
       2.181     0.987500        39450        80.00
       2.209     0.989062        39514        91.43
       2.241     0.990625        39576       106.67
       2.289     0.992188        39638       128.00
       2.325     0.992969        39669       142.22
       2.361     0.993750        39699       160.00
       2.405     0.994531        39731       182.86
       2.451     0.995313        39761       213.33
       2.541     0.996094        39792       256.00
       2.607     0.996484        39810       284.44
       2.701     0.996875        39824       320.00
       2.861     0.997266        39839       365.71
       3.443     0.997656        39855       426.67
       3.747     0.998047        39870       512.00
       3.911     0.998242        39878       568.89
       4.013     0.998437        39886       640.00
       4.127     0.998633        39895       731.43
       4.291     0.998828        39902       853.33
       4.459     0.999023        39909      1024.00
       4.663     0.999121        39913      1137.78
       4.899     0.999219        39917      1280.00
       5.079     0.999316        39921      1462.86
       5.287     0.999414        39925      1706.67
       5.707     0.999512        39929      2048.00
       5.839     0.999561        39931      2275.56
       5.875     0.999609        39933      2560.00
       5.935     0.999658        39935      2925.71
       6.079     0.999707        39937      3413.33
       6.107     0.999756        39939      4096.00
       6.307     0.999780        39940      4551.11
       6.371     0.999805        39941      5120.00
       6.451     0.999829        39942      5851.43
       6.543     0.999854        39943      6826.67
       6.555     0.999878        39944      8192.00
       6.555     0.999890        39944      9102.22
       6.591     0.999902        39945     10240.00
       6.591     0.999915        39945     11702.86
       7.139     0.999927        39946     13653.33
       7.139     0.999939        39946     16384.00
       7.139     0.999945        39946     18204.44
       7.363     0.999951        39947     20480.00
       7.363     0.999957        39947     23405.71
       7.363     0.999963        39947     27306.67
       7.363     0.999969        39947     32768.00
       7.363     0.999973        39947     36408.89
       8.927     0.999976        39948     40960.00
       8.927     1.000000        39948          inf
#[Mean    =        1.421, StdDeviation   =        0.346]
#[Max     =        8.920, Total count    =        39948]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49986 requests in 50.00s, 3.19MB read
Requests/sec:    999.67
Transfer/sec:     65.41KB